{
  "HIPSTER": {
    "LOGIN": "Log In",
    "LOGOUT": "Log Out",
    "HOME": "See all posts",
    "SEARCH": "Search in Hipster",
    "PROFILE": "Profile",
    "LANGUAGE": "Language",
    "CLASS": "Classify Posts",
    "CLASS_M_RECENT": "Most Recent",
    "CLASS_L_RECENT": "Less Recent",
    "CLASS_L_POPULAR": "Less Popular",
    "CLASS_M_POPULAR": "Most Popular",
    "SEND_REPORT": "Send Report",
    "REPORT": "Report",
    "LANGUAGES": {
      "PT": "Português",
      "EN": "English"
    }
  },
  "FILTER_OPTIONS": {
    "FILTER_OPTIONS": "Filter results",
    "GENRES": "GENRES",
    "CLASSIFY_POSTS": "CLASSIFY RESULTS",
    "DATE": "PUBLICATION DATE"
  },
  "FEEDBACK": {
    "MESSAGE": "Message",
    "SEND": "Send",
    "CANCEL": "Cancel",
    "SUCCESS_TITLE": "Report submited",
    "SUCCESS_TEXT": "We'll avaliate your report soon",
    "FAIL_TITLE": "Report not submited"
  },
  "PROFILEPAGE": {
    "PROFILE_NOT_FOUND": "User not found",
    "ABOUT": "About",
    "TIMELINE": "Timeline",
    "GENREFAVORITES": "Favorite Genres",
    "EVENT_POST": "You posted",
    "FAVORITE": "Favorite",
    "POSTS": "Posts",
    "PROFILE": "Profile"
  },
  "POST": {
    "BY": "By ",
    "AT": "at ",
    "REPLY": "Reply",
    "SEND": "Write an comment...",
    "LIKE": "Like",
    "LIKES": "Likes",
    "DELETE": "Delete",
    "SHARE": "Share",
    "ARTIST": "Artist",
    "SEE_MORE": "Show more...",
    "HIDE": "Show less...",
    "MESSAGE": "TO BE DEFINED: Some message talking about the limits, likes, popularity, etc"
  },
  "REGISTER": {
    "DAY": "Day",
    "MONTH": "Month",
    "YEAR": "Year",
    "UPDATE": "Update",
    "SUBMIT": "Sign Up",
    "INVITE": "Join us!",
    "CANCEL": "Cancel",
    "PERSONAL": "Personal info",
    "USER": "User info",
    "EMAIL": "E-mail address",
    "USERNAME": "Username",
    "BIRTHDATE": "Birth date",
    "PASSWORD": "Password",
    "NAME": "Name",
    "LOGIN_FB": "Login with Facebook",
    "LOGIN_GOOGLE": "Login with Google",
    "CONCLUSION": "Proceed with registration",
    "CONCLUSION_MESSAGE": "Check your e-mail to proceed with registration."
  },
  "CONFIRMATION": {
    "CONFIRMATION_TITLE": "Last Step",
    "CONFIRMATION_SUCCESS": "Your register was confirmed with success. Now on you are a trully Hipster signin and enjoy our plataform!",
    "CONFIRMATION_ERROR": "You have failed this city! Ops, wrong tv show! Something has failed, contact our support!"
  },
  "DELETEMODAL": {
    "DELETE_ACCOUNT": "Delete account",
    "DELETE_MESSAGE": "Do you have sure that you want to delete your account? All your posts and information gonna be deleted permanently.",
    "CANCEL": "Cancel"
  },
  "PUBLICATION": {
    "SHARE_MESSAGE":"Share a new music",
    "TITLE": "Title (Optional)",
    "URL": "URL",
    "DESCRIPTION": "Description",
    "GENRES": "Genres",
    "YEAR": "Publish Year (Optional)",
    "ARTIST": "Artist (Opctional)",
    "COMMENTS": "Comments"
  },
  "ERRORS": {
    "REGISTER": {
      "NAME": "A name need to be informed",
      "USERNAME": "An username need to be informed",
      "PASSWORD": "A password need to be informed",
      "EMAIL": "An email need to be informed",
      "DAY": "A day need to be informed",
      "MONTH": "A day need to be informed",
      "YEAR": "A day need to be informed"
    },
    "PUBLICATION": {
      "URL": "An url need to be informed"
    },
    "RESPONSE": {
      "PUBLICATION": {
        "VALIDACAO_OWNER": "Publication has to have a creator",
        "VALIDACAO_URL": "Publication has to have an url",
        "VALIDACAO_GENRES": "Publication has to have at least one genre",
        "VALIDACAO_CATEGORY": "Publication has to be a music",
        "VALIDACAO_URL_YOUTUBE": "Publication has to have a valid url from youtube",
        "VALIDACAO_VIEW_COUNT": "Publication has more than 1 million of views"
      },
      "REPORT": {
        "VALIDACAO_OWNER": "Report owner invalid",
        "VALIDACAO_REPORTED_USER": "Reported user invalid",
        "VALIDACAO_DESCRIPTION": "Report description invalid",
        "VALIDACAO_REPORT_YOURSELF": "User can't report himself"
      }
    }
  },
  "GENERAL": {
    "CANCEL": "Cancel"
  },
  "TERMS_CONDITIONS": {
    "TITLE": "Terms and Conditions",
    "ACCEPT": "I agree to the Terms and Conditions",
    "INTRODUCTION_TITLE": "INTRODUCTION",
    "INTRODUCTION_TEXT": "The hipster team is pleased to offer you access to this website (the 'Hispter'), both the site and the other services of the Hipster team are subject to these Terms and Conditions of Use. These Terms apply to all users of the Hipster, including users who are also contributors of User Generated Content (as hereinafter defined). By proceeding beyond the site home page or viewing or posting content, you express your consent to, agreement with, and understanding of these terms. The hipster team may, in its sole discretion, modify, restrict, change, or otherwise alter these terms, the site, in whole or in part, impose limits on certain features on the site, or restrict your access to part or all of the site. By continuing to access and use the site and/or the commscope social networks you will be evidencing your consent to, agreement with, and understanding of, such modifications, changes or alterations. Please review these terms regularly as they may be modified from time to time without notice to you.",
    "USER_CONTENT_TITLE": "USER GENERATED CONTENT",
    "USER_CONTENT_TEXT": "You may submit content, including text, video links to the Hipster (collectively, 'User Generated Content'), provided that you abide by these common sense rules:",
    "USER_CONTENT_PART1_TITLE": "1. If you post it, you own it",
    "USER_CONTENT_PART1_TEXT": "Keep in mind that even if original content can be deleted, the content that is shared and distributed through an array of channels can be reposted, searched, and found on the Internet.",
    "USER_CONTENT_PART2_TITLE": "2. Respect the law, including with regard to intellectual property",
    "USER_CONTENT_PART2_TEXT": "It is critical that you show proper respect for the law generally, and specifically for the laws governing copyright and fair use of copyrighted material. Do not post images, videos or other copyrighted content unless you own them or have permission from the owner to display such content in this context. Keep in mind that the laws may differ depending on where you live.",
    "USER_CONTENT_PART3_TITLE": "3. Treat others like you want to be treated",
    "USER_CONTENT_PART3_TEXT": "Be respectful of others’ opinions and beliefs. Use common courtesy when posting content: refrain from abusive, obscene, or offensive language, images, or links. Do not post content from, or links to, Internet sites that feature sexual content, gambling, or that advocate intolerance of others; and do not create such content on Hipster.",
    "USER_CONTENT_PART4_TITLE": "4. Do not post confidential or proprietary information",
    "USER_CONTENT_PART4_TEXT": "By posting content to Hipster, you are agreeing to allow anyone with access to Hipster to access it and use it without restriction, except with regard to any applicable intellectual property rights that you or others may have in such content. You agree that you will not post or transmit material that is confidential or proprietary to you or a third-party.",
    "RESPONSABILITY_TITLE": "HIPSTER’s RIGHTS AND DISCLAIMERS",
    "RESPONSABILITY_PART1": "You grant to Hipster a worldwide, non-exclusive, perpetual, irrevocable, royalty-free and fully-paid, transferable right (including the right to sublicense) to exercise all copyright, publicity, and moral rights with respect to any User Generated Content you post on the Hipster in any media formats and through any media channels.",
    "RESPONSABILITY_PART2": "Hispter expressly disclaims any liability or responsibility for the User Generated Content posted on the Site, and such content does not necessarily represent the opinions or positions of Hipster.",
    "RESPONSABILITY_PART3": "Hipster does not promise or guarantee that any User Generated Content posted on the Hipster is correct or accurate, and Hipster does not necessarily agree with or endorse such content.",
    "RESPONSABILITY_PART4": "Hipster retains the right to decline to post any User Generated Content, or remove any previously posted content on Hipster in our sole discretion.",
    "RESPONSABILITY_PART5": "You understand that when using the Site or the Hipster, you will be exposed to User Generated Content from a variety of sources, and that Hipster is not responsible for the usefulness, safety, or intellectual property rights of or relating to such User Generated Content. You further understand and acknowledge that you may be exposed to User Generated Content that is inaccurate, offensive, indecent, or objectionable, and you agree to waive, and hereby do waive, any legal or equitable rights or remedies you have or may have against Hispter with respect thereto.",
    "PRIVACY_TITLE": "PRIVACY",
    "PRIVACY_PART1": "Hipster respects your personal privacy and the sensitivity of your corporate information. When you visit the Site, we may collect personally identifiable information that you choose to voluntarily disclose. We also may automatically collect certain website use information as you browse the Site. We may share your personal information with other companies and individuals that perform supporting functions in connection with orders for Hipster products (e.g., credit card processing), and with maintaining the Site. Except as provided herein, we will not share your personal information or any website use information with any party unless required by law.",
    "PRIVACY_PART2": "Be considerate of others’ privacy, do not reference another without his or her permission.",
    "SAFETY_TITLE": "SAFETY",
    "SAFETY_PART1": "You will not post unauthorized commercial communications (such as spam) on Hipster.",
    "SAFETY_PART2": "You will not upload viruses or other malicious code.",
    "SAFETY_PART3": "You will not solicit login information or access an account belonging to someone else.",
    "SAFETY_PART4": "You will not collect users' content or information, or otherwise access Hipster, using automated means (such as harvesting bots, robots, spiders, or scrapers) without our prior permission.",
    "SAFETY_PART5": "You will not engage in unlawful multi-level marketing, such as a pyramid scheme, on Hipster.",
    "SAFETY_PART6": "You will not bully, intimidate, or harass any user.",
    "SAFETY_PART7": "You will not post content that: is hate speech, threatening, or pornographic; incites violence; or contains nudity or graphic or gratuitous violence.",
    "SAFETY_PART8": "You will not develop or operate a third-party application containing alcohol-related, dating or other mature content (including advertisements) without appropriate age-based restrictions.",
    "SAFETY_PART9": "You will not use Hipster to do anything unlawful, misleading, malicious, or discriminatory.",
    "SAFETY_PART10": "You will not do anything that could disable, overburden, or impair the proper working or appearance of Hipster, such as a denial of service attack or interference with page rendering or other Hipster functionality.",
    "SAFETY_PART11": "You will not facilitate or encourage any violations of this Statement or our policies."
  }
}
